x = int(input('Введите первое число'))
y = int(input('Введите второе число'))
z = int(input('Введите третье число'))
if x <= 3 and x >= 1:
    print('Первое число принадлежит интервалу [1,3]')
else:
    print('Первое число не принадлежит интервалу [1,3]')
if y <= 3 and y >= 1:
   print('Второе число принадлежит интервалу [1,3]')
else:
    print('Второе число не принадлежит интервалу [1,3]')
if z <= 3 and z >= 1:
    print('Третье число принадлежит интервалу [1,3]')
else:
    print('Третье число не принадлежит интервалу [1,3]')
